---
kind: method
id: M:Autodesk.Revit.DB.DataConversionMonitorScope.#ctor(Autodesk.Revit.DB.IDataConversionMonitor)
source: html/c9b0994f-03f2-7bea-3f5d-228b3cd72835.htm
---
# Autodesk.Revit.DB.DataConversionMonitorScope.#ctor Method

The only constructor. Expects a valid pointer to IDataConversionMonitor.

## Syntax (C#)
```csharp
public DataConversionMonitorScope(
	IDataConversionMonitor IDCM
)
```

## Parameters
- **IDCM** (`Autodesk.Revit.DB.IDataConversionMonitor`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null